In [17]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
data={"Name":["a","r","a","t"],"eng":[8,9,8,6]}
df=pd.DataFrame(data)
df

  Name  eng
0    a    8
1    r    9
2    a    8
3    t    6

In [18]:
df.drop_duplicates(inplace=True)
df

  Name  eng
0    a    8
1    r    9
3    t    6

In [19]:
d1=pd.read_csv(r"R:\CSV Files\loan.csv")
d1.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [20]:
d1.shape

(614, 13)

In [22]:
d1.drop_duplicates(inplace=True)

In [23]:
d1.shape

(614, 13)